src/ChartsOfCharacteristicTypes/pr_ЛокальныеКонстанты/pr_ЛокальныеКонстанты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>pr_ЛокальныеКонстанты</name>
  <type>
    <types>Boolean</types>
    <types>CatalogRef.pr_МакетыЭлементовФорм</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>ChartOfCharacteristicTypesRef.pr_ЛокальныеКонстанты</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>100</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПароль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

src/ChartsOfCharacteristicTypes/pr_ЛокальныеКонстанты/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначениеКонстанты, "Константа",
		Объект.Ссылка, , , Истина);
	НастроитьЭлементыДляРежимаПароля();
		Если ЗначениеЗаполнено(Объект.Идентификатор) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Идентификатор,"Пароль"); 
		УстановитьПривилегированныйРежим(Ложь);
		Если Пароль <> Неопределено Тогда
			
			Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПарольИзменен Тогда
  УстановитьПривилегированныйРежим(Истина);
  ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Идентификатор, Пароль);
  УстановитьПривилегированныйРежим(Ложь);
  Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
  ПарольИзменен = Ложь;
 КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗначениеКонстанты, "Константа",
		Объект.Ссылка, , , Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПарольПриИзменении(Элемент)
	НастроитьЭлементыДляРежимаПароля();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Значения

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НастроитьЭлементыДляРежимаПароля()
	ВидимостьДоступность = Не Объект.ЭтоПароль;
	ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗначения", "Видимость",
		ВидимостьДоступность);
	ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТипЗначения", "Видимость",
		ВидимостьДоступность);
	ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Логин", "Видимость",
		Не ВидимостьДоступность);
	ОбщегоНазначенияклиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Пароль", "Видимость",
		Не ВидимостьДоступность);

КонецПроцедуры
#КонецОбласти
